# MICROSOFT MOVIE STUDIO ANALYSIS

## INTRODUCTION

## Business Problem

### Objectives

To solve the above problem and help in steering Microsoft in the right direction in this endeavour, the following are this project's objectives

<b>Main Objective</b>
> Pass

<b>Specific Objectives</b>
1. To ...
2. To ...
3. To ...

## Experimental Design

The research follows the steps as listed:
1. Introduction and Business Problem
2. Loading Data and Relevant Libraries
3. Data Wrangling and Preparation
4. Data Exploration and Visualization
5. Conclusions
6. Recommendations

## Metric of Success
The project will be considered a success once it yields at least three actionable and data-driven recommendations to Mircosoft which can ensure the company focuses on the right steps while breaking into the Movie Industry

## Data Description

To be described

## Loading Libraries

In [1]:
import pandas as pd
import numpy as np
import sqlite3
import seaborn as sns
from matplotlib import pyplot as plt
%matplotlib inline

## Loading Data

In [2]:
# Creating a connection to database file
conn = sqlite3.connect("./data/im.db")


# Query for all tables
tablesQuery = """
SELECT name FROM sqlite_master
WHERE type='table';
"""

# Executing query
pd.read_sql(tablesQuery, conn)

            name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

> From the abov, there are 8 tables, investigating them reveals the following:

### DataBase Files

**Writers Table**

In [3]:
table1 = """
Select * FROM writers
LIMIT 10;
"""
pd.read_sql(table1, conn)

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0438973  nm0175726
2  tt0438973  nm1802864
3  tt0462036  nm1940585
4  tt0835418  nm0310087
5  tt0835418  nm0841532
6  tt0878654  nm0284943
7  tt0878654  nm0284943
8  tt0878654  nm0284943
9  tt0996958  nm2286991

> The table above is giving information about the writers responsible for various movies using respective IDs.

**Directors Table**

In [4]:
table2 = """
SELECT * FROM directors
LIMIT 10
"""

pd.read_sql(table2, conn)

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585
2  tt0835418  nm0151540
3  tt0835418  nm0151540
4  tt0878654  nm0089502
5  tt0878654  nm2291498
6  tt0878654  nm2292011
7  tt0879859  nm2416460
8  tt0996958  nm2286991
9  tt0996958  nm2286991

> The table above is giving information about the directors responsible for various movies using respective IDs.

**Movie Basics Table**

In [5]:
table3 = """
SELECT * FROM movie_basics
LIMIT 10;
"""

pd.read_sql(table3, conn)

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
5,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy
6,tt0112502,Bigfoot,Bigfoot,2017,NaN,"Horror,Thriller"
7,tt0137204,Joe Finds Grace,Joe Finds Grace,2017,83.0,"Adventure,Animation,Comedy"
8,tt0139613,O Silêncio,O Silêncio,2012,NaN,"Documentary,History"
9,tt0144449,Nema aviona za Zagreb,Nema aviona za Zagreb,2012,82.0,Biography

> The above table gives information about basic attributes of movies:
* Titles
* Runtime in Minutes
* Genres spanned
* Start/Release Year

**Movie AKAs**

In [6]:
table4 = """
SELECT * FROM movie_akas
LIMIT 10;
"""
pd.read_sql(table4, conn)

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0
5,tt0369610,15,Jurassic World,GR,None,imdbDisplay,None,0.0
6,tt0369610,16,Jurassic World,IT,None,imdbDisplay,None,0.0
7,tt0369610,17,Jurski svijet,HR,None,imdbDisplay,None,0.0
8,tt0369610,18,Olam ha'Yura,IL,he,imdbDisplay,None,0.0
9,tt0369610,19,Jurassic World: Mundo Jurásico,MX,None,imdbDisplay,None,0.0

> At first glance, the above table has no relevant information to use in the analysis that is not already in other preceeding tables

**Movie Ratings Table**

In [7]:
table5 = """
SELECT * FROM movie_ratings
LIMIT 10;
"""

pd.read_sql(table5, conn)

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21
5   tt1069246            6.2       326
6   tt1094666            7.0      1613
7   tt1130982            6.4       571
8   tt1156528            7.2       265
9   tt1161457            4.2       148

> The above table seems to be conveying the average rating for a movie as well as the number of votes contributing to said rating

**Known For**

In [8]:
table6 = """
SELECT * FROM known_for
LIMIT 10;
"""

pd.read_sql(table6, conn)

   person_id   movie_id
0  nm0061671  tt0837562
1  nm0061671  tt2398241
2  nm0061671  tt0844471
3  nm0061671  tt0118553
4  nm0061865  tt0896534
5  nm0061865  tt6791238
6  nm0061865  tt0287072
7  nm0061865  tt1682940
8  nm0062070  tt1470654
9  nm0062070  tt0363631

> Going off on a limb, the data above probably represents actors and which works they are famous for.

**Principals**

In [9]:
table7 = """
SELECT * FROM principals
LIMIT 10;
"""

pd.read_sql(table7, conn)

,movie_id,ordering,person_id,category,job,characters
0,tt0111414,1,nm0246005,actor,None,"[""The Man""]"
1,tt0111414,2,nm0398271,director,None,None
2,tt0111414,3,nm3739909,producer,producer,None
3,tt0323808,10,nm0059247,editor,None,None
4,tt0323808,1,nm3579312,actress,None,"[""Beth Boothby""]"
5,tt0323808,2,nm2694680,actor,None,"[""Steve Thomson""]"
6,tt0323808,3,nm0574615,actor,None,"[""Sir Lachlan Morrison""]"
7,tt0323808,4,nm0502652,actress,None,"[""Lady Delia Morrison""]"
8,tt0323808,5,nm0362736,director,None,None
9,tt0323808,6,nm0811056,producer,producer,None

> The above data will not be used in the analysis to follow.

**Persons**

In [10]:
table8 = """
SELECT * FROM persons
LIMIT 10;
"""

pd.read_sql(table8, conn)

,person_id,primary_name,birth_year,death_year,primary_profession
0,nm0061671,Mary Ellen Bauder,NaN,None,"miscellaneous,production_manager,producer"
1,nm0061865,Joseph Bauer,NaN,None,"composer,music_department,sound_department"
2,nm0062070,Bruce Baum,NaN,None,"miscellaneous,actor,writer"
3,nm0062195,Axel Baumann,NaN,None,"camera_department,cinematographer,art_department"
4,nm0062798,Pete Baxter,NaN,None,"production_designer,art_department,set_decorator"
5,nm0062879,Ruel S. Bayani,NaN,None,"director,production_manager,miscellaneous"
6,nm0063198,Bayou,NaN,None,actor
7,nm0063432,Stevie Be-Zet,NaN,None,"composer,soundtrack"
8,nm0063618,Jeff Beal,1963.0,None,"composer,music_department,soundtrack"
9,nm0063750,Lindsay Beamish,NaN,None,"actress,miscellaneous"

> This table details what professions key individuals in the database do and when they were born/laid to rest; it is not relevant to the ensuing analysis.

## Loading Data

### From Database

In [11]:
# Joining relevant information into a single table
movieBasicsDf = pd.read_sql("""
                SELECT primary_title, start_year, runtime_minutes, genres, averagerating, numvotes
                FROM movie_basics
                JOIN movie_ratings
                    USING(movie_id)
                WHERE genres IS NOT NULL;
                """, conn)

print(movieBasicsDf.shape, end="\n\n")
movieBasicsDf.head()

(73052, 6)

,primary_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77
1,One Day Before the Rainy Season,2019,114.0,"Biography,Drama",7.2,43
2,The Other Side of the Wind,2018,122.0,Drama,6.9,4517
3,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13
4,The Wandering Soap Opera,2017,80.0,"Comedy,Drama,Fantasy",6.5,119

## From Flat Files

In [12]:
!ls ./data

bom.movie_gross.csv
im.db
rt.movie_info.tsv
rt.reviews.tsv
tmdb.movies.csv
tn.movie_budgets.csv

In [13]:
movieGrossDf = pd.read_csv("./data/bom.movie_gross.csv")
movieInfoDf = pd.read_csv("./data/rt.movie_info.tsv", delimiter="\t")
movieBudgetsDf = pd.read_csv("./data/tn.movie_budgets.csv")
imdbRatingsDf = pd.read_csv("./data/tmdb.movies.csv", index_col=0)

### Basic Information from Datasets

In [14]:
# Movie Basics
movieBasicsDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73052 entries, 0 to 73051
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   primary_title    73052 non-null  object
 1   start_year       73052 non-null  int64
 2   runtime_minutes  65720 non-null  float64
 3   genres           73052 non-null  object
 4   averagerating    73052 non-null  float64
 5   numvotes         73052 non-null  int64
dtypes: float64(2), int64(2), object(2)
memory usage: 3.3+ MB

> The above data has 6 columns and 73,052 rows.
All of the null values are focused around runtime length.
The data types for respective fields is seemingly appropriate.

In [15]:
# Movie Gross
movieGrossDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

> The above data has 3387 rows and 5 columns.

1. Studio field has 5 null values
2. Domestic gross has 28 null values
3. Foreign gross has 350 null values

The only field with an incorrect data type for analysis purpose is Foreign Gross. This needs to be converted to numeric.

In [16]:
# Movie Info
movieInfoDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            1560 non-null   int64
 1   synopsis      1498 non-null   object
 2   rating        1557 non-null   object
 3   genre         1552 non-null   object
 4   director      1361 non-null   object
 5   writer        1111 non-null   object
 6   theater_date  1201 non-null   object
 7   dvd_date      1201 non-null   object
 8   currency      340 non-null    object
 9   box_office    340 non-null    object
 10  runtime       1530 non-null   object
 11  studio        494 non-null    object
dtypes: int64(1), object(11)
memory usage: 146.4+ KB

In [17]:
movieInfoDf.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

> The data has 12 columns and 1560 rows with a lot of null values

The columns with meaningul information to the analysis - rating, director, runtime and studio, need wrangling(Consistency and Validity concerns) to be analysis ready.

In [18]:
# Movie Budgets

movieBudgetsDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

> The above data has 6 columns and 5782 rows with numbers-focused fields being casted as object-types.
There are no missing values.

In [19]:
# IMDB data

imdbRatingsDf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26517 entries, 0 to 26516
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   genre_ids          26517 non-null  object
 1   id                 26517 non-null  int64
 2   original_language  26517 non-null  object
 3   original_title     26517 non-null  object
 4   popularity         26517 non-null  float64
 5   release_date       26517 non-null  object
 6   title              26517 non-null  object
 7   vote_average       26517 non-null  float64
 8   vote_count         26517 non-null  int64
dtypes: float64(2), int64(2), object(5)
memory usage: 2.0+ MB

> The data above has 9 columns and 26517 rows with no missing values.
Release date needs to be cast as datetime

## Data Cleaning

## Movie Basics Dataset

In [20]:
# Preview the first five rows

movieBasicsDf.head()

,primary_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77
1,One Day Before the Rainy Season,2019,114.0,"Biography,Drama",7.2,43
2,The Other Side of the Wind,2018,122.0,Drama,6.9,4517
3,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13
4,The Wandering Soap Opera,2017,80.0,"Comedy,Drama,Fantasy",6.5,119

#### Completeness

Since the missing values account for roughly 8000/73000 rows, imputing them with aggregate values would skew the data. The best option in this scenario would be to drop them as they would have minimal effect on how much data is left.

In [21]:
# Dropping nulll values

movieBasicsDf.dropna(subset=['runtime_minutes'],inplace=True)

In [22]:
movieBasicsDf.isna().sum()

primary_title      0
start_year         0
runtime_minutes    0
genres             0
averagerating      0
numvotes           0
dtype: int64

#### Consistency

In [23]:
# Checking for duplicates
movieBasicsDf.duplicated(subset=['primary_title']).sum()

3276

In [24]:
# Filtering for duplicates
basicsDuplicates = movieBasicsDf.loc[movieBasicsDf.duplicated(subset=['primary_title'],
                                                             keep=False)]

# Filtering out a `SettingWithCopyWarning`
pd.options.mode.chained_assignment = None
# Sorting by Primary Title and then Start Year
basicsDuplicates.sort_values(by=["primary_title", 'start_year'], inplace=True,
                            ascending=True)

# Printing the shape of the duplicated data
print(basicsDuplicates.shape, end="\n\n")

# Viewing the first 20 records
basicsDuplicates.head(20)

(5666, 6)

,primary_title,start_year,runtime_minutes,genres,averagerating,numvotes
25696,1,2013,112.0,"Documentary,History,Sport",8.0,3452
12137,1,2019,100.0,Drama,9.2,13
12367,100% Love,2011,141.0,"Comedy,Drama,Romance",7.0,2331
26467,100% Love,2012,166.0,"Comedy,Drama,Romance",6.0,296
12001,180,2011,121.0,"Drama,Romance",6.0,688
14435,180,2011,107.0,"Comedy,Drama",7.4,42
8025,1960,2010,75.0,Documentary,6.8,49
33615,1960,2013,66.0,"Biography,Documentary",5.9,8
57234,1985,2016,114.0,"Adventure,Comedy,Drama",8.1,30
60879,1985,2018,85.0,Drama,6.8,998
38992,1989,2014,54.0,Documentary,6.8,5
42650,1989,2014,97.0,"Documentary,History,Thriller",7.5,175
30470,21 Days,2014,89.0,"Horror,Thriller",4.5,454
44378,21 Days,2014,70.0,Documentary,6.0,5
3725,3,2010,119.0,"Comedy,Drama,Romance",6.7,4722
17634,3,2012,145.0,"Drama,Mystery,Romance",7.2,3471
23394,3,2012,115.0,"Comedy,Drama",6.1,101
54773,3,2018,80.0,"Horror,Mystery,Thriller",3.9,166
45498,3/4,2014,80.0,Drama,5.8,8
64616,3/4,2017,83.0,Drama,6.3,196

>All duplicates will be dropped. Also, note that the above ouptut shows all rows WITH their duplicates due to the argument `keep` being set to True

In [25]:
# Resetting the option to `Warn`
pd.options.mode.chained_assignment = 'warn'

In [26]:
# Dropping the duplicates
movieBasicsDf.drop_duplicates(subset=['primary_title'], keep='first',
                             inplace=True)

#### Validity

In [27]:
# Checking for proper data types within the dataframe
movieBasicsDf.dtypes

primary_title       object
start_year           int64
runtime_minutes    float64
genres              object
averagerating      float64
numvotes             int64
dtype: object

>Everything seems to be in order for this dataframe

### Movie Gross Dataset

In [28]:
movieGrossDf.shape

(3387, 5)

#### Completeness

In [29]:
# Checking for null values
movieGrossDf.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

<p> Nearly half of the rows in this dataset have null values in the _foreign_gross_ column. From speculation, this could be one of two reasons:

1. The data was never recorded, or
2. The movie did not make any money inernationally.

Either way, these will be imputed with a value of 0. The same goes for Domestic Gross
</p>

In [31]:
# Imputing nulls in numeric columns
movieGrossDf['domestic_gross'].fillna(value=0, inplace=True)
movieGrossDf['foreign_gross'].fillna(value=0, inplace=True)

In [33]:
# Dropping nulls in studio column
movieGrossDf.dropna(subset=['studio'], inplace=True)

#### Consistency

In [34]:
# Checking for duplicates
movieGrossDf.duplicated().sum()

0

#### Validity

In [35]:
# Checking column data types
movieGrossDf.dtypes

title              object
studio             object
domestic_gross    float64
foreign_gross      object
year                int64
dtype: object

> Foreign gross needs to be numeric

In [36]:
movieGrossDf['foreign_gross'].head(10)

0    652000000
1    691300000
2    664300000
3    535700000
4    513900000
5    398000000
6    311500000
7    391000000
8    291600000
9    277300000
Name: foreign_gross, dtype: object

In [40]:
movieGrossDf.loc[movieGrossDf['foreign_gross'].str.contains(',')]

ValueError: Cannot mask with non-boolean array containing NA / NaN values

In [41]:
movieGrossDf.isnull().sum()

title             0
studio            0
domestic_gross    0
foreign_gross     0
year              0
dtype: int64

In [42]:
movieGrossDf.loc[3380:,'foreign_gross']

3380    0
3381    0
3382    0
3383    0
3384    0
3385    0
3386    0
Name: foreign_gross, dtype: object